---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsStartConstraintChanged
source: html/8d7fd7b3-4a9a-bd4a-0dbd-83a7842e4e1b.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsStartConstraintChanged Property

Indicates if the start handle constraint has changed since the last regeneration.

## Syntax (C#)
```csharp
public bool IsStartConstraintChanged { get; }
```